{
	"name": "TAG2",
	"description": "[h1]Description[/h1]\nThrall Automated Gathering (TAG) is a mod designed to automate the process of collecting resources. While your thralls spend all their time standing around, now they can be useful while you're AFK. Using the new feats (Search for TAG in your feats list) provided to unlock the recipes.\n\nJoin the discord to get more information, or get help troubleshooting what's wrong if you're experiencing any issues:\nhttps://discord.gg/qRqfDmArkm\n\n[h1]Basic Instructions:[/h1]\n[olist]\n[*]Unlock the TAG feat in your feat's menu\n[*]Craft a TAG token (some tokens are craftable in your personal inventory, others are in the torturer's workbench)\n[*]Put down a container for your thrall to gather to - this can be a chest, box, crafting bench, or just about anything else that has an inventory (excluding yourself or followers)\n[*]put a thrall inside the bench\n[*]put the TAG Token right after the thrall (you will have to use 'custom' sorting)\n[*] Optionally, put a tool after the token\n[*]wait and profit!\n[/olist]\nConfiguration has been added! use the following commands (must be admin) to change the rates so your server feels more at home:\n[list]\n[*]DataCmd TAG_Rate [0.1 - 100]\ne.g.: DataCmd TAG_Rate 3.5\nDetermines how many resources are returned each cycle.\n\n[*]DataCmd TAG_Time [0.1 - 100]\ne.g.: DataCmd TAG_Time 3.5\nDetermines how long it takes for each cycle to run\n\n[*]DataCmd TAG_Message [0-4]\ne.g.: DataCmd TAG_Message 1\nDetermines how many messages are displayed on screen.  1 is the same as normal.  0 is no messages whatsoever.  4 starts to show debug messages and you will get spammed.  This is a server setting, I don't know how to make it individual.\n\n[*]DataCmd TAG_Human [0/1]\ne.g.: DataCmd TAG_Human 1\nDetermines whether or not players can use the human tag.  If set to 0, players can make the 'Target Humanoid' token, but it won't actually run and gather items.  If set to 1, players can now target humans - give your thrall a religious harvest tool to get religious items like essence, or sliver of the unfulfilled.  NOTE: Targeting humans REQUIRES a T4 thrall.  Putting in a T3 thrall will not work, and you'll be told that your token is not proceeded by a thrall.\n[/list]\n[more to come with future updates - check here to see them!]\n\nhttps://github.com/dracahn/CE-ThrallAutomatedGathering\n\n\n[h1]Future Features:[/h1]\n[olist]\n[*][strike]Configurable rates/times for gathering[/strike]\n[*]blackout times (configurable)\n[*]Tool Degredation (configurable)\n[*]Risk of Thrall Death/failure (configurable)\n[*]Add configuration to Token Scaling.  E.G. T1 tokens take 10 minutes, T2 take 20, and T3 take 30.  Allow a user to make that T1 = 10, T2 = 15 and T3 = 20.\n[/olist]\n\n[h1]Known issues:[/h1]\n[olist]\n[*]?[strike]Sometimes the mod claims that containers are full even through they're not.  I have no idea how to replicate this so I can find out why, but I'm looking into it.[/strike]?\n     2.1.0 - I think I've fixed it.  I was comparing array length to MaxItemCount.  Problem is, arrays can hold 'null' or 'empty' values.  That still contributes to the array length.  So you put an item in, it increases the array length.  Take it out, and it just sets that array container to null, but doesn't remove the additional container.  I'm too used to Lists in C#.  Now I '\n[*]If someone else opens your container it can change the sorting to be 'by weight' or 'by name' instead of custom.  That stops the thralls inside from gathering, and you have to go re-sort your container.  I'll try to fix that in a upcoming update.  In the mean time, sorry about your gremlin friends messing with your s*** :)\n     2.1.0 - Tried to address this.  Didn't find any easy fixes.  Still something I'll look into, but I wanted to get the config update done first.  Funcom doesn't seem to have an easy way to force a player's sorting.  So It's going to be a long dig to try to find something and make is usable.\n[*][strike]Sometimes Thralls aren't registering as thralls.  IDK what the problem is here.  Imma blame funcom.  I was able to replicate the issue on my test world.  It kept happening and I was trying to figure out how to fix it.  I added a quick log, tried again to read the log, and it worked.  The Items comes back as a thrall, but when I check if it's human (and not an animal) it just....fails.  I get the spawn Data Table, and for some reason the 'NPC Class' value come back as null.  I don't know how much I can do to investigate/fix this.[/strike]\n[/olist]\n[h1]For Devs[/h1]\n[quote]\nMod ID: 2472764949\nData Tables prefix: 651238XXX\n[/quote]\nDevs, please check out the following discussion for details on making your mod compatible, or adding your own TAG tokens to your mod.\nhttps://steamcommunity.com/workshop/filedetails/discussion/2472764949/3372657330760106185/",
	"changeNote": "The following has been added:\n[olist]\n[*]Most importantly, i re-did the thrall identification code.  Instead of relying on funcom's code, I'm relying on accessing data table values.  A bit less expansive, so modded thralls probably won't work, but...well, they probably weren't with the old code anyway.  So far I haven't had any lazy thralls.\n[*]Added a new console command: DataCmd TAG_Message [int 0-4].  This allows you to set how often those annoying messages show up.  Set it to 0 to hide all messages and popup from TAG.  1 shows what it did before.  2, 3, and 4 are for showing debug messages.  You'll get spammed with a lot of crap if you have that turned up.  It's a server setting.  I don't know how to make it a player setting.\n[*]Added a new console command: DataCmd TAG_Human [int 0-1].  This allows you to set whether or not targeting humans is allowed.  (Note: when targetting humans, I specifically overrode the arm and leg drops you get from harvesting them so you shouldn't get any).  This is only for the harvesting, so no armor/weapon drops.  Just what you get from smacking the corpse.\n[*]Speaking of targeting humans - added a new target token to target humans.  This allows for getting human flesh, or (this is what I'll use it for) religious items.\n[*]Re-worked parts of the loot system.  It should now correctly only drop 1 of items that should only drop once (religious items, heads, etc.).  It should also limit what items can be gathered correctly.  E.g. you cannot gather wood with a pick, or meat with a skinning knife.  A bit of a nerf, but makes things more reliable.\n[/olist]",
	"author": "dracahn",
	"authorUrl": "https://github.com/dracahn",
	"versionMajor": 3,
	"versionMinor": 0,
	"versionBuild": 0,
	"bRequiresLoadOnStartup": false,
	"steamPublishedFileId": "2472764949",
	"steamTestLivePublishedFileId": "",
	"steamVisibility": 0,
	"folderName": "TAG2",
	"revisionNumber": 408177,
	"snapshotId": 34671,
	"fileSize": -2
}