{
	"name": "TAG2",
	"description": "Thrall Automated Gathering (TAG) is a mod designed to automate the process of collecting resources. While your thralls spend all their time standing around, now they can be useful while you're AFK. Using the new feats (Search for TAG in your feats list) provided to unlock the recipes.\n\nJoin the discord to get more information, or get help troubleshooting what's wrong if you're experiencing any issues:\nhttps://discord.gg/qRqfDmArkm\n\nBasic Instructions:\n1. Unlock the TAG feat in your feat's menu\n2. Craft a TAG token (some tokens are craftable in your personal inventory, others are in the torturer's workbench)\n3. Put down a container for your thrall to gather to - this can be a chest, box, crafting bench, or just about anything else that has an inventory (excluding yourself or followers)\n4. put a thrall inside the bench\n5. put the TAG Token right after the thrall (you will have to use 'custom' sorting)\n6. Optionally, put a tool after the token\n7. wait and profit!\n\nConfiguration has been added! use the following commands (must be admin) to change the rates so your server feels more at home:\nDataCmd TAG_Rate [float]\nDataCmd TAG_Time [float]\n[more to come with fiture updates - check here fto see them!]\n\nhttps://github.com/dracahn/CE-ThrallAutomatedGathering\n\n\nFuture Features:\n1. [strike]Configurable rates/times for gathering[strike]\n2. blackout times (configurable)\n3. Tool Degredation (configurable)\n4. Risk of Thrall Death/failure (configurable)\n5. Add configuration to Token Scaling.  E.G. T1 tokens take 10 minutes, T2 take 20, and T3 take 30.  Allow a user to make that T1 = 10, T2 = 15 and T3 = 20.\n\nKnown issues:\n1. ?[strike]Sometimes the mod claims that containers are full even through they're not.  I have no idea how to replicate this so I can find out why, but I'm looking into it.[strike]?\n     2.1.0 - I think I've fixed it.  I was comparing array length to MaxItemCount.  Problem is, arrays can hold 'null' or 'empty' values.  That still contributes to the array length.  So you put an item in, it increases the array length.  Take it out, and it just sets that array container to null, but doesn't remove the additional container.  I'm too used to Lists in C#.  Now I '\n2. If someone else opens your container it can change the sorting to be 'by weight' or 'by name' instead of custom.  That stops the thralls inside from gathering, and you have to go re-sort your container.  I'll try to fix that in a upcoming update.  In the mean time, sorry about your gremlin friends messing with your s*** :)\n     2.1.0 - Tried to address this.  Didn't find any easy fixes.  Still something I'll look into, but I wanted to get the config update done first.  Funcom doesn't seem to have an easy way to force a player's sorting.  So It's going to be a long dig to try to find something and make is usable.\n3. Sometimes Thralls aren't registerring as thralls.  IDK what the problem is here.  Imma blame funcom.  I was able to replicate the issue on my test world.  It kept happening and I was trying to figure out how to fix it.  I added a quick log, tried again to read the log, and it worked.  The Items comes back as a thrall, but when I check if it's human (and not an animal) it just....fails.  I get the spawn Data Table, and for some reason the 'NPC Class' value come back as null.  I don't know how much I can do to investigate/fix this.",
	"changeNote": "Bugfix:\nRemoved a debug popup from appearing - sorry about that.\nAdded some extra feedback around 'full' containers.  Letting the player know how many items it finds and how much the max is in case those return values are.....bad.  It's hard to replicate, and I couldn't get it working after adding the logs (only got it replicated once before).  Post screenshots if you see the message when you shouldn't.\nFixed Panther Target Token Recipe to use a Panther head instead of a Deer head.\n\nAdded:\nUsers can now configure the Rates and Times that thralls gather.  Default values are 1 for the rates, and 10 for the time.\nThese are configured via console commands.  Running the commands without adding values will display the current values to you.\n(for those not versed in programming: where it says 'float' put in a number.  It can have a decimal or not - your choice)\nDataCmd TAG_Rate [float]\nDataCmd TAG_Time [float]\n\ne.g.\nDataCmd TAG_Rate\n     - This will display the current TAG config values\n\nDataCmd TAG_Rate 1.5\n     - This will increase the amount of resrources gathered by ~50% each time a Thrall Gathers\n\nDataCmd TAG_Time 1\n     - This will se the amount of time it take a T1 resource to be gathered by a T1 thrall to 1 minute.  (default it 10)\n\nDataCmd TAG_Time 30\n     - This will se the time to gather to be ~3 times higher than default: 30 minutes for a T1 thrall to gather a single T1 resource.",
	"author": "dracahn",
	"authorUrl": "https://github.com/dracahn",
	"versionMajor": 2,
	"versionMinor": 1,
	"versionBuild": 0,
	"bRequiresLoadOnStartup": false,
	"steamPublishedFileId": "2472764949",
	"steamVisibility": 0,
	"folderName": "TAG2",
	"revisionNumber": 291664,
	"snapshotId": 29282
}